app/controllers/api/v1/instruments_controller.rb

    def index
      instruments = Instrument.all
---
SELECT "instruments".* FROM "instruments"