app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    messages = Message.all

INSERT INTO "messages" ("sender_id", "recipient_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 1], ["recipient_id", 2], ["message", "hello"], ["created_at", "2018-03-18 22:15:35.327055"], ["updated_at", "2018-03-18 22:15:35.327055"]]
---
def create
  message = Message.create(message_params)