app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "image_url", "age", "gender", "top_song_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "asfafs"], ["image_url", "fasds"], ["age", 0], ["gender", "asdassdas"], ["top_song_url", "asd"], ["created_at", "2018-03-14 21:36:18.566348"], ["updated_at", "2018-03-14 21:36:18.566348"]]
SELECT  "user_instruments".* FROM "user_instruments" WHERE "user_instruments"."user_id" = $1 AND "user_instruments"."instrument_id" = $2 LIMIT $3  [["user_id", 4], ["instrument_id", 2], ["LIMIT", 1]]
INSERT INTO "user_instruments" ("user_id", "instrument_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 28], ["instrument_id", 1], ["created_at", "2018-03-15 14:32:27.474909"], ["updated_at", "2018-03-15 14:32:27.474909"]]
UPDATE "user_instruments" SET "seeking" = $1, "updated_at" = $2 WHERE "user_instruments"."id" = $3  [["seeking", "f"], ["updated_at", "2018-03-15 16:53:49.184837"], ["id", 5]]
SELECT "artists".* FROM "artists"
INSERT INTO "user_artists" ("user_id", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 29], ["artist_id", 1], ["created_at", "2018-03-15 14:40:09.527458"], ["updated_at", "2018-03-15 14:40:09.527458"]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "genres".* FROM "genres"
INSERT INTO "user_genres" ("user_id", "genre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 29], ["genre_id", 1], ["created_at", "2018-03-15 14:40:09.552971"], ["updated_at", "2018-03-15 14:40:09.552971"]]
---
def create
user = User.create(user_params)

  rel_inst_ids = params[:selectedInstruments].map {|i| i["id"].to_i}
  relevant_instruments = Instrument.all.select {|inst| rel_inst_ids.include?(inst[:id])}
  relevant_instruments.each do |relInst|
    user.instruments << relInst
    relevant_user_instrument = user.user_instruments.find_by instrument_id: relInst[:id]
    relevant_user_instrument.update(:seeking => false)
  end

  rel_s_inst_ids = params[:seekingInstruments].map {|s_i| s_i["id"].to_i}
  relevant_s_instruments = Instrument.all.select {|s_inst| rel_s_inst_ids.include?(s_inst[:id])}
  relevant_s_instruments.each do |rel_s_Inst|
    user.instruments << rel_s_Inst
    relevant_user_s_instrument = user.user_instruments.find_by instrument_id: rel_s_Inst[:id]
    relevant_user_s_instrument.update(:seeking => true)
  end

  rel_artist_ids = params[:selectedArtists].map {|a| a["id"].to_i}
  relevant_artists = Artist.all.select {|art| rel_artist_ids.include?(art[:id])}
  relevant_artists.each {|relArt| user.artists << relArt}

  rel_genre_ids = params[:selectedGenres].map {|g| g["id"].to_i}
  relevant_genres = Genre.all.select {|gen| rel_genre_ids.include?(gen[:id])}
  relevant_genres.each {|relGen| user.genres << relGen}