app/controllers/api/v1/user_genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    genres = Genre.all